from pandas import DataFrame

print('构建DataFrame的办法有很多，最常用的一种是直接传入一个由等长列表或NumPy数组组成的字典')

paints={
    "字画名称":["旭日东升","富水长流","招财进宝","鸿运当头"],
    "字画底价":[2860,498,1068,598],
    "字画拍卖加价":[1000,2000,500,1500]
}
goods_in=DataFrame(paints)
print(goods_in)


print('\n通过参数columns指定列的顺序为“字画名称”“字画拍卖加价”“字画底价”，这样的顺序与原字典的顺序不同。')

paints = {
    "字画名称":["旭日东升","富水长流","招财进宝","鸿运当头"],
    "字画底价":[2860,498,1068,598],
    "字画拍卖加价":[1000,2000,500,1500]
}
goods_in = DataFrame(paints, columns = ["字画名称", "字画拍卖加价", "字画底价"])
print(goods_in)


print('\n如果传入的列名在数据中是无法找到的，就会产生NaN值')
paints = {
    "字画名称":["旭日东升","富水长流","招财进宝","鸿运当头"],
    "字画底价":[2860,498,1068,598],
    "字画拍卖加价":[1000,2000,500,1500]
}
goods_in = DataFrame(paints, columns = ["字画名称", "字画拍卖加价", "字画底价", "字画所属人"])
print(goods_in)